Revit 2027 API
UIApplication.CreateAddInCommandBinding Method
Creates a new AddInCommandBinding.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInCommandBinding CreateAddInCommandBinding(
	RevitCommandId revitCommandId
)
Public Function CreateAddInCommandBinding (
	revitCommandId As RevitCommandId
) As AddInCommandBinding
public:
AddInCommandBinding^ CreateAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
member CreateAddInCommandBinding :
        revitCommandId : RevitCommandId -> AddInCommandBinding
Parameters
revitCommandId RevitCommandId
The Revit command id to identify the command handler you want to replace.
Return Value
AddInCommandBinding
Exceptions
Exception | Condition
ArgumentNullException | Thrown when uiApplication or revitCommandId is null.
InvalidOperationException |  Thrown when the given command already has been bound.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace